--В заданной строке символов будем считать числом произвольную последовательность 
--цифр, слева и справа от которой не находится цифра.
--Написать функцию maxNumber :: String -> Integer, выдающую числовое значение 
--самого большого “числа” в строке. Например, результатом вызова функции с 
--аргументом "0xFF55 00012 -100 19" должно быть 100. 
--Если чисел в строке нет совсем, то это ошибка аргумента.

--Идея : вычленить из строки числа и сравнить их
--Реализация : с помощью функции splitRegex вычленяем числа, где соответсвенно
--mkRegex "[^0-9]" является условием на принадлежность к числу 
--Далее во избежание ошибки read отфильтровываем полученные числа, убирая 
--пустые символы. 
--Применяем read для перевода строки в число и сравниваем maximum-ом.

module Homework where

import Text.Regex

maxNumber :: String -> Integer
maxNumber xs = maximum (map read (filter (not.null) (splitRegex (mkRegex "[^0-9]") xs)))


main =  [
        maxNumber "0xFF55 00012 -100 19" == 100,
        maxNumber "200fx789 0056 312 d88f" == 789
        ]
