-- Задание: 
-- Написать функцию hasPair :: Integer -> Bool, которая проверяет, есть ли в 
-- десятичной записи заданного числа две подряд идущие одинаковые цифры. 
-- Например, hasPair 1001 => True, а hasPair 1212 => False.

-- hasPair - функция проверки числа n
-- в начале проверяем на отрицательность и получаем неотрицательное число
-- Далее работаем с функцией function которая на вход получает 2 значения
-- остаток от деления на 10 (а) и целое от того же деления (b)
-- Получаем "разбиение" числа (пример 1001 и работаем с 1 и 100)
-- проверяем целое на 0 (чтобы был смысл сравнивать, иначе "разбиение" числа
-- окончено и выдается False)
-- Сравниваем a и остаток от деления на 10 числа b (получаем сравнение соседних
-- цифр)
-- Далее работаем со следующей парой, "разбивая" целое от n (b)

module Task where
hasPair :: Integer -> Bool
hasPair n
  | n < 0 = hasPair (-n)
  | otherwise = function (mod n 10) (div n 10)
    where 
    function :: Integer -> Integer -> Bool
    function a b
      | b == 0         = False
      | a ==(mod b 10) = True
      | otherwise      = function (mod b 10) (div b 10)
